tony-cloud/STM32_duino/STM32/boards.txt
NUCLEO_L476.menu.clock_source.hsi=HSE_Disable(HSI)
NUCLEO_L476.menu.clock_source.hsi.build.f_cpu={build.f_cpuhsi} -DUSE_HSI

NUCLEO_L476.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
NUCLEO_L476.menu.clock_source.hse8m.build.f_cpu={build.f_cpuhse} -DUSE_HSE -DHSE_VALUE=8000000

NUCLEO_L476.menu.startadr.default=flash(default)
NUCLEO_L476.menu.startadr.default.build.extra_flags={build.extra_flags0}

NUCLEO_L476.menu.startadr.F08020000=flash 1:0x08020000(128k)
NUCLEO_L476.menu.startadr.F08020000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08020000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
NUCLEO_L476.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
NUCLEO_L476.menu.startadr.F08020000.upload.uploadadr=0x08020000
NUCLEO_L476.menu.startadr.F08020000.upload.vect=0x08020000

NUCLEO_L476.menu.startadr.F08040000=flash 2:0x08040000(128k)
NUCLEO_L476.menu.startadr.F08040000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08040000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
NUCLEO_L476.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
NUCLEO_L476.menu.startadr.F08040000.upload.uploadadr=0x08040000
NUCLEO_L476.menu.startadr.F08040000.upload.vect=0x08040000

NUCLEO_L476.menu.startadr.F08060000=flash 3:0x08060000(128k)
NUCLEO_L476.menu.startadr.F08060000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08060000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
NUCLEO_L476.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
NUCLEO_L476.menu.startadr.F08060000.upload.uploadadr=0x08060000
NUCLEO_L476.menu.startadr.F08060000.upload.vect=0x08060000

NUCLEO_L476.menu.startadr.F08080000=flash 4:0x08080000(128k)
NUCLEO_L476.menu.startadr.F08080000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08080000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
NUCLEO_L476.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
NUCLEO_L476.menu.startadr.F08080000.upload.uploadadr=0x08080000
NUCLEO_L476.menu.startadr.F08080000.upload.vect=0x08080000

NUCLEO_L476.menu.startadr.F080A0000=flash 5:0x080A0000(128k)
NUCLEO_L476.menu.startadr.F080A0000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F080A0000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F080A0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xA0000
NUCLEO_L476.menu.startadr.F080A0000.build.ldscript={build.ldscript_pre}_080A.ld
NUCLEO_L476.menu.startadr.F080A0000.upload.uploadadr=0x080A0000
NUCLEO_L476.menu.startadr.F080A0000.upload.vect=0x080A0000

NUCLEO_L476.menu.startadr.F080C0000=flash 6:0x080C0000(128k)
NUCLEO_L476.menu.startadr.F080C0000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F080C0000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
NUCLEO_L476.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
NUCLEO_L476.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
NUCLEO_L476.menu.startadr.F080C0000.upload.vect=0x080C0000

NUCLEO_L476.menu.startadr.F080E0000=flash 7:0x080E0000(128k)
NUCLEO_L476.menu.startadr.F080E0000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F080E0000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F080E0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xE0000
NUCLEO_L476.menu.startadr.F080E0000.build.ldscript={build.ldscript_pre}_080E.ld
NUCLEO_L476.menu.startadr.F080E0000.upload.uploadadr=0x080E0000
NUCLEO_L476.menu.startadr.F080E0000.upload.vect=0x080E0000

NUCLEO_L476.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
NUCLEO_L476.menu.startadr.F08000000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08000000.upload.maximum_data_size=32768
NUCLEO_L476.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
NUCLEO_L476.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
NUCLEO_L476.menu.startadr.F08000000.upload.uploadadr=0x08000000
NUCLEO_L476.menu.startadr.F08000000.upload.vect=0x08000000

NUCLEO_L476.menu.startadr.R20000000=Sram 0:0x20000000(64K+32K BOOT=11 St/Jlink uploader only)
NUCLEO_L476.menu.startadr.R20000000.upload.maximum_size=65536
NUCLEO_L476.menu.startadr.R20000000.upload.maximum_data_size=32768
NUCLEO_L476.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
NUCLEO_L476.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
NUCLEO_L476.menu.startadr.R20000000.upload.uploadadr=0x20000000
NUCLEO_L476.menu.startadr.R20000000.upload.vect=0x20000000

NUCLEO_L476.upload.protocol=STLink
NUCLEO_L476.upload.tool=stlink_upload


#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUCLEO_L476.menu.log.default=Release
NUCLEO_L476.menu.log.default.build.log_level=-fno-exceptions
NUCLEO_L476.menu.log.fatal=FATAL
NUCLEO_L476.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.error=ERROR
NUCLEO_L476.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.warning=WARNING
NUCLEO_L476.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.info=INFO
NUCLEO_L476.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.debug=DEBUG
NUCLEO_L476.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.trace=TRACE
NUCLEO_L476.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

##################################### Discovery L053C8 ###########################################
# Discovery L053C8 board(32M)

DISCOVERY_L053C8.name=Discovery L053C8

DISCOVERY_L053C8.upload.maximum_size=65536
DISCOVERY_L053C8.upload.maximum_data_size=8192

