tony-cloud/STM32_duino/STM32/boards.txt
DISCOVERY_F429ZI.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F429ZI.build.series=STM32F4
DISCOVERY_F429ZI.build.variant=DISCOVERY_F429ZI
DISCOVERY_F429ZI.build.extra_flags=-DSTM32F429ZI -DSTM32F429xx

DISCOVERY_F429ZI.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_F429ZI.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_F429ZI.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_F429ZI.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_F429ZI.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_F429ZI.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

DISCOVERY_F429ZI.menu.extern_lib.NONE=NONE
DISCOVERY_F429ZI.menu.extern_lib.STemWin=STemWin
DISCOVERY_F429ZI.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
DISCOVERY_F429ZI.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
DISCOVERY_F429ZI.menu.extern_lib.STemWinOS=STemWin_OS
DISCOVERY_F429ZI.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
DISCOVERY_F429ZI.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

DISCOVERY_F429ZI.menu.usb.Disabled=Disabled USB
DISCOVERY_F429ZI.menu.usb.SerialUSB=Serial [Virtual COM port]
DISCOVERY_F429ZI.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F429ZI.menu.usb.SerialMSC=Mass storage
DISCOVERY_F429ZI.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

DISCOVERY_F429ZI.menu.serial.SerialUART1=SerialUART1 [PA9/PA10]
DISCOVERY_F429ZI.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_F429ZI.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F429ZI.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

# TBD: correct memory settings here and in ldscript !!
DISCOVERY_F429ZI.upload.maximum_size=2097152
DISCOVERY_F429ZI.upload.maximum_data_size=196608

DISCOVERY_F429ZI.upload.protocol=STLink
DISCOVERY_F429ZI.upload.tool=stlink_upload

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
DISCOVERY_F429ZI.menu.log.default=Release
DISCOVERY_F429ZI.menu.log.default.build.log_level=-fno-exceptions
DISCOVERY_F429ZI.menu.log.fatal=FATAL
DISCOVERY_F429ZI.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
DISCOVERY_F429ZI.menu.log.error=ERROR
DISCOVERY_F429ZI.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
DISCOVERY_F429ZI.menu.log.warning=WARNING
DISCOVERY_F429ZI.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
DISCOVERY_F429ZI.menu.log.info=INFO
DISCOVERY_F429ZI.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
DISCOVERY_F429ZI.menu.log.debug=DEBUG
DISCOVERY_F429ZI.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
DISCOVERY_F429ZI.menu.log.trace=TRACE
DISCOVERY_F429ZI.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

######################################## Discovery F746NG ########################################
# Discovery F746NG board

DISCOVERY_F746NG.name=Discovery F746NG(216M)

DISCOVERY_F746NG.upload.maximum_size=1048576
DISCOVERY_F746NG.upload.maximum_data_size=327680

DISCOVERY_F746NG.build.core=arduino
DISCOVERY_F746NG.build.board=DISCOVERY_F746NG

DISCOVERY_F746NG.build.mcu=cortex-m7 -mfloat-abi=hard -mfpu=fpv4-sp-d16
DISCOVERY_F746NG.build.series=STM32F7
DISCOVERY_F746NG.build.variant=DISCOVERY_F746NG
DISCOVERY_F746NG.build.f_cpupre=216000000L
DISCOVERY_F746NG.build.extra_flags=-DSTM32F746NG -DDATA_IN_ExtSDRAM

DISCOVERY_F746NG.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_F746NG.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_F746NG.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_F746NG.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_F746NG.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_F746NG.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

#DISCOVERY_F746NG.upload.protocol=STLink
#DISCOVERY_F746NG.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.STLinkMethod=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.massstorage_drive=DIS_F746NG

DISCOVERY_F746NG.menu.usb.Disabled=Disabled USB
DISCOVERY_F746NG.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
DISCOVERY_F746NG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F746NG.menu.usb.SerialMSC=Mass storage
DISCOVERY_F746NG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

DISCOVERY_F746NG.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PB7/PA9]
DISCOVERY_F746NG.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_F746NG.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F746NG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
DISCOVERY_F746NG.menu.log.default=Release
DISCOVERY_F746NG.menu.log.default.build.log_level=-fno-exceptions
DISCOVERY_F746NG.menu.log.fatal=FATAL
DISCOVERY_F746NG.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.error=ERROR
DISCOVERY_F746NG.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.warning=WARNING
DISCOVERY_F746NG.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.info=INFO
DISCOVERY_F746NG.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.debug=DEBUG
DISCOVERY_F746NG.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.trace=TRACE
DISCOVERY_F746NG.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

