tony-cloud/STM32_duino/STM32/boards.txt
MapleMini.menu.upload_method.DFUUploadMethod1=USB DFU - Maple bootloader (original version) (0x5000)
MapleMini.menu.upload_method.DFUUploadMethod1.upload.protocol=maple_dfu
MapleMini.menu.upload_method.DFUUploadMethod1.upload.tool=maple_upload
MapleMini.menu.upload_method.DFUUploadMethod1.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x5000 -DUSB_DISC_PIN=PB9
MapleMini.menu.upload_method.DFUUploadMethod1.build.ldscript={build.ldscript_pre}_bootloader_5000.ld
MapleMini.menu.upload_method.DFUUploadMethod1.upload.usbID=1EAF:0003
MapleMini.menu.upload_method.DFUUploadMethod1.upload.altID=UNUSED
MapleMini.menu.upload_method.DFUUploadMethod1.maximum_data_size=110592
MapleMini.menu.upload_method.DFUUploadMethod1.flash.maximum_size=110592
MapleMini.menu.upload_method.DFUUploadMethod1.ram.maximum_size=17408
MapleMini.menu.upload_method.DFUUploadMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini.menu.usb.Disabled=Disabled USB
MapleMini.menu.usb.SerialUSB=Serial[Virtual COM port, PA11/PA12]
MapleMini.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
MapleMini.menu.usb.SerialMSC=Mass storage
MapleMini.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
MapleMini.menu.usb.Composite=Composite[CDC+MSC]
MapleMini.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

MapleMini.menu.serial.SerialUSB=SerialUSB
MapleMini.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
MapleMini.menu.serial.SerialUART1=SerialUART1
MapleMini.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
MapleMini.menu.serial.Automatic=Automatically selected based on upload method

#MapleMini.menu.jtag_swd.default=Debug_default[SWD]
MapleMini.menu.jtag_swd.SWD=SWD [debug pins reserved: (PA14,PA13)]
MapleMini.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
MapleMini.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB3,PB4,PA13,PA14,PA15]
MapleMini.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
MapleMini.menu.jtag_swd.Disabled=Disabled [debug pins free]
MapleMini.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
MapleMini.menu.log.default=Release
MapleMini.menu.log.default.build.log_level=-fno-exceptions
MapleMini.menu.log.fatal=FATAL
MapleMini.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
MapleMini.menu.log.error=ERROR
MapleMini.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
MapleMini.menu.log.warning=WARNING
MapleMini.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
MapleMini.menu.log.info=INFO
MapleMini.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
MapleMini.menu.log.debug=DEBUG
MapleMini.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
MapleMini.menu.log.trace=TRACE
MapleMini.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

####################################### F103CB#########################################
# BluePill board
BluePill.name=F103Cx
BluePill.upload.uploadadr=0x08000000
BluePill.upload.vect=0x08000000
BluePill.serial.disableDTR=true
BluePill.serial.disableRTS=true

BluePill.build.mcu=cortex-m3
BluePill.build.board=BLUEPILL_F103CB
BluePill.build.core=arduino
BluePill.build.variant=BLUEPILL
BluePill.build.series=STM32F1
BluePill.build.f_cpu=72000000L

BluePill.menu.subboard.F103CB=BluePill F103C8/B[LED PC13/SWD]
BluePill.menu.subboard.F103CB.upload.maximum_size=131072
BluePill.menu.subboard.F103CB.upload.maximum_data_size=20480
BluePill.menu.subboard.F103CB.upload.device=STM32F103CB
BluePill.menu.subboard.F103CB.build.extra_flags0=-DSTM32F103CB
BluePill.menu.subboard.F103CB.build.ldscript_pre=ld/f103xB
BluePill.menu.subboard.F103CB.build.ldscript=ld/f103xB.ld
BluePill.menu.subboard.F103CB.build.board=BluePill_F103CB
BluePill.menu.subboard.F103CB.build.extra_flags_jtag=-DMENU_DEBUG_SWD

BluePill.menu.subboard.GF103CB=GENERIC F103C8/B[LED PB8/JTAG]
BluePill.menu.subboard.GF103CB.upload.maximum_size=131072
BluePill.menu.subboard.GF103CB.upload.maximum_data_size=20480
BluePill.menu.subboard.GF103CB.upload.device=STM32F103CB
BluePill.menu.subboard.GF103CB.build.extra_flags0=-DSTM32F103CB -DLED_BUILTIN=PB8
BluePill.menu.subboard.GF103CB.build.ldscript=ld/f103xB.ld
BluePill.menu.subboard.GF103CB.build.board=F103CB_PB8

BluePill.menu.startadr.default=flash (default)
BluePill.menu.startadr.default.build.extra_flags={build.extra_flags0}

BluePill.menu.startadr.F08004000=flash 1:0x08004000(32k)
BluePill.menu.startadr.F08004000.upload.maximum_size=32768
BluePill.menu.startadr.F08004000.upload.maximum_data_size=20480
BluePill.menu.startadr.F08004000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x04000
BluePill.menu.startadr.F08004000.build.ldscript=ld/f103xB_08004.ld
BluePill.menu.startadr.F08004000.upload.uploadadr=0x08004000
BluePill.menu.startadr.F08004000.upload.vect=0x08004000

BluePill.menu.startadr.F0800C000=flash 2:0x0800C000(32k) 
BluePill.menu.startadr.F0800C000.upload.maximum_size=65525
BluePill.menu.startadr.F0800C000.upload.maximum_data_size=20480
BluePill.menu.startadr.F0800C000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0C000
BluePill.menu.startadr.F0800C000.build.ldscript=ld/f103xB_0800c.ld
BluePill.menu.startadr.F0800C000.upload.uploadadr=0x0800C000
BluePill.menu.startadr.F0800C000.upload.vect=0x0800C000

BluePill.menu.startadr.F08014000=flash 3:0x08014000(48k)
BluePill.menu.startadr.F08014000.upload.maximum_size=49152
BluePill.menu.startadr.F08014000.upload.maximum_data_size=20480
BluePill.menu.startadr.F08014000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x14000
BluePill.menu.startadr.F08014000.build.ldscript=ld/f103xB_08014.ld
BluePill.menu.startadr.F08014000.upload.uploadadr=0x08014000
BluePill.menu.startadr.F08014000.upload.vect=0x08014000

BluePill.menu.startadr.F08000000=flash(WithRamBoot 16kflash + 4kRAM used Only)
BluePill.menu.startadr.F08000000.upload.maximum_size=16384
BluePill.menu.startadr.F08000000.upload.maximum_data_size=4096
BluePill.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
BluePill.menu.startadr.F08000000.build.ldscript=ld/f103xB_0800.ld
BluePill.menu.startadr.F08000000.upload.uploadadr=0x08000000
BluePill.menu.startadr.F08000000.upload.vect=0x08000000

