tony-cloud/STM32_duino/STM32/boards.txt
GD103RB.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
GD103RB.menu.upload_method.MassStorageMethod.upload.protocol=
GD103RB.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

GD103RB.menu.upload_method.serialMethod=Serial[TX/PA9, RX/PA10, BOOT0=1]
GD103RB.menu.upload_method.serialMethod.upload.protocol=maple_serial
GD103RB.menu.upload_method.serialMethod.upload.tool=serial_upload
GD103RB.menu.upload_method.serialMethod.upload.altID=UNUSED
GD103RB.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103RB.menu.upload_method.serialMethod1=Serial[pl2302 AutoLoad]
GD103RB.menu.upload_method.serialMethod1.upload.protocol=maple_serial
GD103RB.menu.upload_method.serialMethod1.upload.tool=serial_upload
GD103RB.menu.upload_method.serialMethod1.upload.altID=PL2303
GD103RB.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103RB.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
GD103RB.menu.upload_method.serialMethod2.upload.protocol=maple_serial
GD103RB.menu.upload_method.serialMethod2.upload.tool=serial_upload
GD103RB.menu.upload_method.serialMethod2.upload.altID=CH340
GD103RB.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103RB.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
GD103RB.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
GD103RB.menu.upload_method.BMPMethod.upload.tool=bmp_upload

GD103RB.menu.usb.Disabled=Disabled USB
GD103RB.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
GD103RB.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
GD103RB.menu.usb.SerialMSC=Mass storage
GD103RB.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
GD103RB.menu.usb.Composite=Composite[CDC+MSC]
GD103RB.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

GD103RB.menu.serial.SerialUART1=SerialUART1[PA9/PA10]
GD103RB.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
GD103RB.menu.serial.SerialUART2=SerialUART2[PA2/PA3]
GD103RB.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
GD103RB.menu.serial.SerialUSB=SerialUSB
GD103RB.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#GD103RB.menu.jtag_swd.default=Debug_default
GD103RB.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
GD103RB.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
GD103RB.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14, PA13]
GD103RB.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103RB.menu.jtag_swd.Disabled=Disabled [debug pins free]
GD103RB.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
GD103RB.menu.log.default=Release
GD103RB.menu.log.default.build.log_level=-fno-exceptions
GD103RB.menu.log.fatal=FATAL
GD103RB.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
GD103RB.menu.log.error=ERROR
GD103RB.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
GD103RB.menu.log.warning=WARNING
GD103RB.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
GD103RB.menu.log.info=INFO
GD103RB.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
GD103RB.menu.log.debug=DEBUG
GD103RB.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
GD103RB.menu.log.trace=TRACE
GD103RB.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

######################################GD103RE#######################################
GD103RE.name=GD32F103RE
GD103RE.vid.0=0x067B
GD103RE.pid.0=0x2303

GD103RE.serial.disableDTR=true
GD103RE.serial.disableRTS=true
GD103RE.upload.uploadadr=0x08000000
GD103RE.upload.vect=0x08000000

GD103RE.build.board=F103R
GD103RE.build.core=arduino
GD103RE.build.series=STM32F1
GD103RE.build.mcu=cortex-m3

GD103RE.menu.subboard.F103RE=ALIENTEK_MINI[F103RE]
GD103RE.menu.subboard.F103RE.upload.maximum_size=524288
GD103RE.menu.subboard.F103RE.upload.maximum_data_size=65536
GD103RE.menu.subboard.F103RE.upload.device=STM32F103RE
GD103RE.menu.subboard.F103RE.build.extra_flags0=-DSTM32F103RE
GD103RE.menu.subboard.F103RE.build.variant=ATKMINI_F103R
GD103RE.menu.subboard.F103RE.build.board=ATKMINI_F103RE
GD103RE.menu.subboard.F103RE.build.ldscript=ld/f103xE.ld
GD103RE.menu.subboard.F103RE.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103RE.menu.subboard.F103RE.massstorage_drive=NUCLEO

GD103RE.menu.subboard.F103RE1=GENERIC_F103RE[LED PC13]
GD103RE.menu.subboard.F103RE1.upload.maximum_size=524288
GD103RE.menu.subboard.F103RE1.upload.maximum_data_size=65536
GD103RE.menu.subboard.F103RE1.upload.device=STM32F103RE
GD103RE.menu.subboard.F103RE1.build.extra_flags0=-DSTM32F103RE
GD103RE.menu.subboard.F103RE1.build.variant=F103R_GD
GD103RE.menu.subboard.F103RE1.build.board=GENERIC_F103RE
GD103RE.menu.subboard.F103RE1.build.ldscript=ld/f103xE.ld
GD103RE.menu.subboard.F103RE1.massstorage_drive=NUCLEO

GD103RE.menu.startadr.default=flash (default)
GD103RE.menu.startadr.default.build.extra_flags={build.extra_flags0}

GD103RE.menu.startadr.F08010000=flash 1:0x08010000(64k)
GD103RE.menu.startadr.F08010000.upload.maximum_size=65536
GD103RE.menu.startadr.F08010000.upload.maximum_data_size=65536
GD103RE.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
GD103RE.menu.startadr.F08010000.build.ldscript=ld/f103xE_0801.ld
GD103RE.menu.startadr.F08010000.upload.uploadadr=0x08010000
GD103RE.menu.startadr.F08010000.upload.vect=0x08010000

GD103RE.menu.startadr.F08020000=flash 2:0x08020000(64k)
GD103RE.menu.startadr.F08020000.upload.maximum_size=65536
GD103RE.menu.startadr.F08020000.upload.maximum_data_size=65536
GD103RE.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
GD103RE.menu.startadr.F08020000.build.ldscript=ld/f103xE_0802.ld
GD103RE.menu.startadr.F08020000.upload.uploadadr=0x08020000
GD103RE.menu.startadr.F08020000.upload.vect=0x08020000

GD103RE.menu.startadr.F08030000=flash 3:0x08030000(64k)
GD103RE.menu.startadr.F08030000.upload.maximum_size=65536
GD103RE.menu.startadr.F08030000.upload.maximum_data_size=65536
GD103RE.menu.startadr.F08030000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x30000
GD103RE.menu.startadr.F08030000.build.ldscript=ld/f103xE_0803.ld
GD103RE.menu.startadr.F08030000.upload.uploadadr=0x08030000
GD103RE.menu.startadr.F08030000.upload.vect=0x08030000

