tony-cloud/STM32_duino/STM32/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F103RE.menu.log.default=Release
F103RE.menu.log.default.build.log_level=-fno-exceptions
F103RE.menu.log.fatal=FATAL
F103RE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F103RE.menu.log.error=ERROR
F103RE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F103RE.menu.log.warning=WARNING
F103RE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F103RE.menu.log.info=INFO
F103RE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F103RE.menu.log.debug=DEBUG
F103RE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F103RE.menu.log.trace=TRACE
F103RE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

##################################F103V board##############################################
F103V.name=F103V
F103V.vid.0=0x067B
F103V.pid.0=0x2303

F103V.build.mcu=cortex-m3
F103V.build.board=GENERIC_F103V
F103V.build.core=arduino
F103V.build.series=STM32F1
F103V.build.f_cpu=72000000L

F103V.serial.disableDTR=true
F103V.serial.disableRTS=true
F103V.upload.uploadadr=0x08000000
F103V.upload.vect=0x08000000

F103V.menu.subboard.F103VE=ArmFly_X2[F103VC/D/E PL2303]
F103V.menu.subboard.F103VE.upload.maximum_size=524288
F103V.menu.subboard.F103VE.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE.upload.device=STM32F103VE
F103V.menu.subboard.F103VE.build.extra_flags0=-DSTM32F103VE
F103V.menu.subboard.F103VE.build.variant=ARMFLY_X2_F103VE
F103V.menu.subboard.F103VE.build.board=ARMFLY_X2
F103V.menu.subboard.F103VE.build.ldscript=ld/f103xE.ld
F103V.menu.subboard.F103VE.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE.upload.protocol=maple_serial
F103V.menu.subboard.F103VE.upload.tool=serial_upload
F103V.menu.subboard.F103VE.upload.altID=PL2303
F103V.menu.subboard.F103VE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VE1=GENERIC_F103VC/D/E
F103V.menu.subboard.F103VE1.upload.maximum_size=524288
F103V.menu.subboard.F103VE1.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE1.upload.device=STM32F103VE
F103V.menu.subboard.F103VE1.build.extra_flags0=-DSTM32F103VE
F103V.menu.subboard.F103VE1.build.variant=F103V
F103V.menu.subboard.F103VE1.build.board=GENERIC_F103VE
F103V.menu.subboard.F103VE1.build.ldscript=ld/f103xE.ld
F103V.menu.subboard.F103VE1.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE1.upload.protocol=maple_serial
F103V.menu.subboard.F103VE1.upload.tool=serial_upload
F103V.menu.subboard.F103VE1.upload.altID=CH340
F103V.menu.subboard.F103VE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.startadr.default=flash(default)
F103V.menu.startadr.default.build.extra_flags={build.extra_flags0}

F103V.menu.startadr.F08010000=flash 1:0x08010000(64k)
F103V.menu.startadr.F08010000.upload.maximum_size=65536
F103V.menu.startadr.F08010000.upload.maximum_data_size=65536
F103V.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F103V.menu.startadr.F08010000.build.ldscript=ld/f103xE_0801.ld
F103V.menu.startadr.F08010000.upload.uploadadr=0x08010000
F103V.menu.startadr.F08010000.upload.vect=0x08010000

F103V.menu.startadr.F08020000=flash 2:0x08020000(64k)
F103V.menu.startadr.F08020000.upload.maximum_size=65536
F103V.menu.startadr.F08020000.upload.maximum_data_size=65536
F103V.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F103V.menu.startadr.F08020000.build.ldscript=ld/f103xE_0802.ld
F103V.menu.startadr.F08020000.upload.uploadadr=0x08020000
F103V.menu.startadr.F08020000.upload.vect=0x08020000

F103V.menu.startadr.F08030000=flash 3:0x08030000(64k)
F103V.menu.startadr.F08030000.upload.maximum_size=65536
F103V.menu.startadr.F08030000.upload.maximum_data_size=65536
F103V.menu.startadr.F08030000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x30000
F103V.menu.startadr.F08030000.build.ldscript=ld/f103xE_0803.ld
F103V.menu.startadr.F08030000.upload.uploadadr=0x08030000
F103V.menu.startadr.F08030000.upload.vect=0x08030000

F103V.menu.startadr.F08040000=flash 4:0x08040000(64k)
F103V.menu.startadr.F08040000.upload.maximum_size=65536
F103V.menu.startadr.F08040000.upload.maximum_data_size=65536
F103V.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F103V.menu.startadr.F08040000.build.ldscript=ld/f103xE_0804.ld
F103V.menu.startadr.F08040000.upload.uploadadr=0x08040000
F103V.menu.startadr.F08040000.upload.vect=0x08040000

F103V.menu.startadr.F08050000=flash 5:0x08050000(64k)
F103V.menu.startadr.F08050000.upload.maximum_size=65536
F103V.menu.startadr.F08050000.upload.maximum_data_size=65536
F103V.menu.startadr.F08050000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x50000
F103V.menu.startadr.F08050000.build.ldscript=ld/f103xE_0805.ld
F103V.menu.startadr.F08050000.upload.uploadadr=0x08050000
F103V.menu.startadr.F08050000.upload.vect=0x08050000

F103V.menu.startadr.F08060000=flash 6:0x08060000(64k)
F103V.menu.startadr.F08060000.upload.maximum_size=65536
F103V.menu.startadr.F08060000.upload.maximum_data_size=65536
F103V.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
F103V.menu.startadr.F08060000.build.ldscript=ld/f103xE_0806.ld
F103V.menu.startadr.F08060000.upload.uploadadr=0x08060000
F103V.menu.startadr.F08060000.upload.vect=0x08060000

F103V.menu.startadr.F08070000=flash 7:0x08070000(64k)
F103V.menu.startadr.F08070000.upload.maximum_size=65536
F103V.menu.startadr.F08070000.upload.maximum_data_size=65536
F103V.menu.startadr.F08070000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x70000
F103V.menu.startadr.F08070000.build.ldscript=ld/f103xE_0807.ld
F103V.menu.startadr.F08070000.upload.uploadadr=0x08070000
F103V.menu.startadr.F08070000.upload.vect=0x08070000

F103V.menu.startadr.F08000000=flash(WithRamBoot 20kRAM used Only)
F103V.menu.startadr.F08000000.upload.maximum_size=65536
F103V.menu.startadr.F08000000.upload.maximum_data_size=20480
F103V.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F103V.menu.startadr.F08000000.build.ldscript=ld/f103xE_0800.ld
F103V.menu.startadr.F08000000.upload.uploadadr=0x08000000
F103V.menu.startadr.F08000000.upload.vect=0x08000000

