tony-cloud/STM32_duino/STM32/boards.txt
F103V.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader only)
F103V.menu.startadr.R20000000.upload.maximum_size=45056
F103V.menu.startadr.R20000000.upload.maximum_data_size=20480
F103V.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103V.menu.startadr.R20000000.build.ldscript=ld/f103xE_RAM0.ld
F103V.menu.startadr.R20000000.upload.uploadadr=0x20000000
F103V.menu.startadr.R20000000.upload.vect=0x20000000

F103V.menu.extern_lib.NONE=NONE
F103V.menu.extern_lib.STemWin=STemWin
F103V.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
F103V.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F103V.menu.extern_lib.STemWinOS=STemWin_OS
F103V.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
F103V.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#---------------------------- UPLOAD METHODS ---------------------------
F103V.menu.upload_method.STLinkMethod=STLink
F103V.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103V.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103V.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103V.menu.upload_method.jLinkMethod=JLink
F103V.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103V.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103V.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103V.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F103V.menu.upload_method.MassStorageMethod.upload.protocol=
F103V.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F103V.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1]
F103V.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod.upload.altID=UNUSED
F103V.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103V.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod1.upload.altID=PL2303
F103V.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103V.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod2.upload.altID=CH340
F103V.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103V.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103V.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103V.menu.usb.Disabled=Disabled USB
F103V.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
F103V.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103V.menu.usb.SerialMSC=Mass storage
F103V.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103V.menu.usb.Composite=Composite[CDC+MSC]
F103V.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103V.menu.serial.SerialUART1=SerialUART1
F103V.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103V.menu.serial.SerialUSB=SerialUSB
F103V.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
F103V.menu.serial.SerialUART2=SerialUART2
F103V.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2

F103V.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4, PB3,PA15,PA14,PA13]
F103V.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103V.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103V.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103V.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103V.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F103V.menu.log.default=Release
F103V.menu.log.default.build.log_level=-fno-exceptions
F103V.menu.log.fatal=FATAL
F103V.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F103V.menu.log.error=ERROR
F103V.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F103V.menu.log.warning=WARNING
F103V.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F103V.menu.log.info=INFO
F103V.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F103V.menu.log.debug=DEBUG
F103V.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F103V.menu.log.trace=TRACE
F103V.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

###################################### F103Z ##########################################
F103Z.name=F103Z

F103Z.serial.disableDTR=true
F103Z.serial.disableRTS=true
F103Z.upload.uploadadr=0x08000000
F103Z.upload.vect=0x08000000

F103Z.build.mcu=cortex-m3
F103Z.build.board=F103Z
F103Z.build.core=arduino
F103Z.build.series=STM32F1
F103Z.build.f_cpu=72000000L

F103Z.menu.subboard.F103ZE1=HY_RedBull_V2[F103ZE]
F103Z.menu.subboard.F103ZE1.upload.maximum_size=524288
F103Z.menu.subboard.F103ZE1.upload.maximum_data_size=524288
F103Z.menu.subboard.F103ZE1.upload.device=STM32F103ZE
F103Z.menu.subboard.F103ZE1.build.variant=REDBULL_V2_F103ZE
F103Z.menu.subboard.F103ZE1.build.board=REDBULL
F103Z.menu.subboard.F103ZE1.build.extra_flags0=-DSTM32F103ZE
F103Z.menu.subboard.F103ZE1.build.ldscript=ld/f103xE.ld
F103Z.menu.subboard.F103ZE1.massstorage_drive=NUCLEO
F103Z.menu.subboard.F103ZE1.upload.protocol=jlink
F103Z.menu.subboard.F103ZE1.upload.tool=jlink_upload
F103Z.menu.subboard.F103ZE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1


F103Z.menu.subboard.F103ZE2=HASEE_V3[F103ZE]
F103Z.menu.subboard.F103ZE2.upload.maximum_size=524288
F103Z.menu.subboard.F103ZE2.upload.maximum_data_size=65536
F103Z.menu.subboard.F103ZE2.upload.device=STM32F103ZE
F103Z.menu.subboard.F103ZE2.build.variant=HASEE_III_F103ZE
#F103Z.menu.subboard.F103ZE2.build.variant=HASEE_III_F103ZE -DDATA_IN_ExtSRAM
F103Z.menu.subboard.F103ZE2.build.board=HASEE_V3
F103Z.menu.subboard.F103ZE2.build.extra_flags0=-DSTM32F103ZE
F103Z.menu.subboard.F103ZE2.build.ldscript=ld/f103xE.ld
F103Z.menu.subboard.F103ZE2.massstorage_drive=NUCLEO
F103Z.menu.subboard.F103ZE2.upload.protocol=STLink
F103Z.menu.subboard.F103ZE2.upload.tool=stlink_upload
F103Z.menu.subboard.F103ZE2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1


