tony-cloud/STM32_duino/STM32/boards.txt
F103Z.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F103Z.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103Z.menu.upload_method.serialMethod.upload.tool=serial_upload
F103Z.menu.upload_method.serialMethod.upload.altID=UNUSED
F103Z.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.upload_method.serialMethod1=Serial[pl2302 AutoLoad]
F103Z.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103Z.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103Z.menu.upload_method.serialMethod1.upload.altID=PL2303
F103Z.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103Z.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103Z.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103Z.menu.upload_method.serialMethod2.upload.altID=CH340
F103Z.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.usb.Disabled=Disabled USB
F103Z.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103Z.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103Z.menu.usb.SerialMSC=Mass storage
F103Z.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103Z.menu.usb.Composite=Composite[CDC+MSC]
F103Z.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103Z.menu.serial.SerialUART1=SerialUART1
F103Z.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103Z.menu.serial.SerialUART2=SerialUART2
F103Z.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F103Z.menu.serial.SerialUART3=SerialUART3
F103Z.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F103Z.menu.serial.SerialUSB=SerialUSB
F103Z.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

F103Z.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103Z.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103Z.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103Z.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103Z.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103Z.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F103Z.menu.log.default=Release
F103Z.menu.log.default.build.log_level=-fno-exceptions
F103Z.menu.log.fatal=FATAL
F103Z.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F103Z.menu.log.error=ERROR
F103Z.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F103Z.menu.log.warning=WARNING
F103Z.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F103Z.menu.log.info=INFO
F103Z.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F103Z.menu.log.debug=DEBUG
F103Z.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F103Z.menu.log.trace=TRACE
F103Z.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

##################################### F401S ###########################################
F401S.name=F401S

F401S.vid.1=0x0483
F401S.pid.1=0x5740

F401S.serial.disableDTR=true
F401S.serial.disableRTS=true
F401S.upload.maximum_size=262144
F401S.upload.maximum_data_size=65536
F401S.upload.uploadadr=0x08000000
F401S.upload.vect=0x08000000

F401S.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
F401S.build.core=arduino
F401S.build.board=F401NANO
F401S.build.series=STM32F4

F401S.menu.subboard.CCU6F=NANO_CCU6
F401S.menu.subboard.CCU6F.upload.maximum_size=262144
F401S.menu.subboard.CCU6F.upload.maximum_data_size=65536
F401S.menu.subboard.CCU6F.build.variant=F401C
F401S.menu.subboard.CCU6F.build.board=F401NANO
F401S.menu.subboard.CCU6F.build.extra_flags0=-DSTM32F401CC
F401S.menu.subboard.CCU6F.massstorage_drive=NUCLEO
#default upload method
F401S.menu.subboard.CCU6F.upload.device=STM32F401CC
F401S.menu.subboard.CCU6F.upload.tool=stlink_upload
F401S.menu.subboard.CCU6F.upload.protocol=STLink
F401S.menu.subboard.CCU6F.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S.menu.startadr.default=flash (default)
F401S.menu.startadr.default.build.extra_flags={build.extra_flags0}

F401S.menu.startadr.F08010000=flash 1:0x08010000(64k)
F401S.menu.startadr.F08010000.upload.maximum_size=65536
F401S.menu.startadr.F08010000.upload.maximum_data_size=65536
F401S.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F401S.menu.startadr.F08010000.build.ldscript=ld/f401xC_0801.ld
F401S.menu.startadr.F08010000.upload.uploadadr=0x08010000
F401S.menu.startadr.F08010000.upload.vect=0x08010000

F401S.menu.startadr.F08020000=flash 2:0x08020000(128k)
F401S.menu.startadr.F08020000.upload.maximum_size=131072
F401S.menu.startadr.F08020000.upload.maximum_data_size=65536
F401S.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F401S.menu.startadr.F08020000.build.ldscript=ld/f401xC_0802.ld
F401S.menu.startadr.F08020000.upload.uploadadr=0x08020000
F401S.menu.startadr.F08020000.upload.vect=0x08020000

F401S.menu.startadr.F08000000=flash(WithRamBoot 20kRAM used Only)
F401S.menu.startadr.F08000000.upload.maximum_size=65536
F401S.menu.startadr.F08000000.upload.maximum_data_size=20480
F401S.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F401S.menu.startadr.F08000000.build.ldscript=ld/f401xC_0800.ld
F401S.menu.startadr.F08000000.upload.uploadadr=0x08000000
F401S.menu.startadr.F08000000.upload.vect=0x08000000

F401S.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader only)
F401S.menu.startadr.R20000000.upload.maximum_size=45056
F401S.menu.startadr.R20000000.upload.maximum_data_size=20480
F401S.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F401S.menu.startadr.R20000000.build.ldscript=ld/f401xC_RAM0.ld
F401S.menu.startadr.R20000000.upload.uploadadr=0x20000000
F401S.menu.startadr.R20000000.upload.vect=0x20000000

F401S.menu.osc_speed.speed_12m=12M (HSE)
F401S.menu.osc_speed.speed_12m.build.osc=-DHSE_VALUE=12000000 -DOSC=12

F401S.menu.osc_speed.speed_08m=8M (HSE)
F401S.menu.osc_speed.speed_08m.build.osc=-DHSE_VALUE=8000000 -DOSC=8

