tony-cloud/STM32_duino/STM32/boards.txt
F407xE.menu.startadr.F08020000=flash 1:0x08020000(128k)
F407xE.menu.startadr.F08020000.upload.maximum_size=131072
F407xE.menu.startadr.F08020000.upload.maximum_data_size=131072
F407xE.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F407xE.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
F407xE.menu.startadr.F08020000.upload.uploadadr=0x08020000
F407xE.menu.startadr.F08020000.upload.vect=0x08020000

F407xE.menu.startadr.F08040000=flash 2:0x08040000(128k)
F407xE.menu.startadr.F08040000.upload.maximum_size=131072
F407xE.menu.startadr.F08040000.upload.maximum_data_size=131072
F407xE.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F407xE.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
F407xE.menu.startadr.F08040000.upload.uploadadr=0x08040000
F407xE.menu.startadr.F08040000.upload.vect=0x08040000

F407xE.menu.startadr.F08060000=flash 3:0x08060000(128k)
F407xE.menu.startadr.F08060000.upload.maximum_size=131072
F407xE.menu.startadr.F08060000.upload.maximum_data_size=131072
F407xE.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
F407xE.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
F407xE.menu.startadr.F08060000.upload.uploadadr=0x08060000
F407xE.menu.startadr.F08060000.upload.vect=0x08060000

F407xE.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
F407xE.menu.startadr.F08000000.upload.maximum_size=131072
F407xE.menu.startadr.F08000000.upload.maximum_data_size=32768
F407xE.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F407xE.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
F407xE.menu.startadr.F08000000.upload.uploadadr=0x08000000
F407xE.menu.startadr.F08000000.upload.vect=0x08000000

F407xE.menu.startadr.R20000000=Sram 0:0x20000000(96K+32K BOOT=11 St/Jlink uploader only)
F407xE.menu.startadr.R20000000.upload.maximum_size=98304
F407xE.menu.startadr.R20000000.upload.maximum_data_size=32768
F407xE.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F407xE.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
F407xE.menu.startadr.R20000000.upload.uploadadr=0x20000000
F407xE.menu.startadr.R20000000.upload.vect=0x20000000

F407xE.menu.extern_lib.NONE=NONE
F407xE.menu.extern_lib.STemWin=STemWin
F407xE.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
F407xE.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F407xE.menu.extern_lib.STemWinOS=STemWin_OS
F407xE.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
F407xE.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#-------------------------------------- UPLOAD METHODS ----------------------------------------#
F407xE.menu.upload_method.jLinkMethod=JLink
F407xE.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F407xE.menu.upload_method.jLinkMethod.upload.protocol=jlink
F407xE.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xE.menu.upload_method.STLinkMethod=STLink
F407xE.menu.upload_method.STLinkMethod.upload.protocol=STLink
F407xE.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F407xE.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xE.menu.upload_method.MassStorageMethod=MassStorage [STLINK V2.1]
F407xE.menu.upload_method.MassStorageMethod.upload.protocol=
F407xE.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F407xE.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F407xE.menu.upload_method.serialMethod.upload.protocol=maple_serial
F407xE.menu.upload_method.serialMethod.upload.tool=serial_upload
F407xE.menu.upload_method.serialMethod.upload.altID=UNUSED
F407xE.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xE.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F407xE.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F407xE.menu.upload_method.serialMethod2.upload.tool=serial_upload
F407xE.menu.upload_method.serialMethod2.upload.altID=CH340
F407xE.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xE.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F407xE.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F407xE.menu.upload_method.serialMethod1.upload.tool=serial_upload
F407xE.menu.upload_method.serialMethod1.upload.altID=PL2303
F407xE.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xE.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F407xE.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F407xE.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F407xE.menu.usb.Disabled=Disabled USB
F407xE.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F407xE.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F407xE.menu.usb.SerialMSC=Mass storage
F407xE.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F407xE.menu.usb.Composite=Composite[CDC+MSC]
F407xE.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F407xE.menu.serial.SerialUART1=SerialUART1
F407xE.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F407xE.menu.serial.SerialUART2=SerialUART2
F407xE.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F407xE.menu.serial.SerialUART3=SerialUART3
F407xE.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F407xE.menu.serial.SerialUSB=SerialUSB
F407xE.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
#F407xE.menu.serial.Automatic=Automatically selected based on upload method

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F407xE.menu.log.default=Release
F407xE.menu.log.default.build.log_level=-fno-exceptions
F407xE.menu.log.fatal=FATAL
F407xE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F407xE.menu.log.error=ERROR
F407xE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F407xE.menu.log.warning=WARNING
F407xE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F407xE.menu.log.info=INFO
F407xE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F407xE.menu.log.debug=DEBUG
F407xE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F407xE.menu.log.trace=TRACE
F407xE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

################################### F407V/Z/I #############################################
F407xG.name=F407xG

F407xG.vid.0=0x1a86
F407xG.pid.0=0x7523

F407xG.vid.1=0x1366
F407xG.pid.1=0x0105

F407xG.serial.disableDTR=true
F407xG.serial.disableRTS=true
F407xG.upload.uploadadr=0x08000000
F407xG.upload.vect=0x08000000

