tony-cloud/STM32_duino/STM32/boards.txt
F407xG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
F407xG.build.core=arduino
F407xG.build.board=ARMFLY_F4
F407xG.build.series=STM32F4
F407xG.build.f_cpu=168000000L

F407xG.menu.subboard.ArmFly_F4=ArmFly_F407ZG
F407xG.menu.subboard.ArmFly_F4.upload.maximum_size=1232896
F407xG.menu.subboard.ArmFly_F4.upload.maximum_data_size=131072
F407xG.menu.subboard.ArmFly_F4.build.variant=ARMFLY_F407ZG
F407xG.menu.subboard.ArmFly_F4.build.board=ARMFLY_F4
F407xG.menu.subboard.ArmFly_F4.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407xG.menu.subboard.ArmFly_F4.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.ArmFly_F4.massstorage_drive=NUCLEO
F407xG.menu.subboard.ArmFly_F4.upload.device=STM32F407ZG
#default upload method
F407xG.menu.subboard.ArmFly_F4.upload.protocol=
F407xG.menu.subboard.ArmFly_F4.upload.tool=nucleoFlasher
F407xG.menu.subboard.ArmFly_F4.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.subboard.IMT407GV21=ILLUMINATI_F407ZG[JLink SerialUART3]
F407xG.menu.subboard.IMT407GV21.upload.maximum_size=1232896
F407xG.menu.subboard.IMT407GV21.upload.maximum_data_size=131072
F407xG.menu.subboard.IMT407GV21.build.variant=ILLUMINATI_F407ZG
F407xG.menu.subboard.IMT407GV21.build.board=IMT407GV21
F407xG.menu.subboard.IMT407GV21.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407xG.menu.subboard.IMT407GV21.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.IMT407GV21.massstorage_drive=NUCLEO
F407xG.menu.subboard.IMT407GV21.upload.device=STM32F407ZG
#default upload method
F407xG.menu.subboard.IMT407GV21.upload.tool=jlink_upload
F407xG.menu.subboard.IMT407GV21.upload.protocol=jlink
F407xG.menu.subboard.IMT407GV21.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3

F407xG.menu.subboard.IGT6_CORE=F407IG_CORE[GREEN]
F407xG.menu.subboard.IGT6_CORE.upload.maximum_size=1232896
F407xG.menu.subboard.IGT6_CORE.upload.maximum_data_size=131072
F407xG.menu.subboard.IGT6_CORE.build.variant=F407IG_CORE
F407xG.menu.subboard.IGT6_CORE.build.board=IGT6CORE
F407xG.menu.subboard.IGT6_CORE.build.extra_flags0=-DSTM32F407IG -DHSE_VALUE=8000000
F407xG.menu.subboard.IGT6_CORE.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.IGT6_CORE.massstorage_drive=NUCLEO
F407xG.menu.subboard.IGT6_CORE.upload.device=STM32F407IG
#default upload method
F407xG.menu.subboard.IGT6_CORE.upload.protocol=
F407xG.menu.subboard.IGT6_CORE.upload.tool=nucleoFlasher
F407xG.menu.subboard.IGT6_CORE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.subboard.BLACK_F407ZG=GENERIC_F407ZG
F407xG.menu.subboard.BLACK_F407ZG.upload.maximum_size=1232896
F407xG.menu.subboard.BLACK_F407ZG.upload.maximum_data_size=131072
F407xG.menu.subboard.BLACK_F407ZG.build.variant=BLACK_F407ZG
F407xG.menu.subboard.BLACK_F407ZG.build.board=GENERIC_F407ZG
F407xG.menu.subboard.BLACK_F407ZG.build.extra_flags0=-DSTM32F407ZG -DHSE_VALUE=8000000
F407xG.menu.subboard.BLACK_F407ZG.build.ldscript_pre=ld/f407xG
F407xG.menu.subboard.BLACK_F407ZG.upload.device=STM32F407ZG
F407xG.menu.subboard.BLACK_F407ZG.upload.protocol=STLink
F407xG.menu.subboard.BLACK_F407ZG.upload.tool=stlink_upload
F407xG.menu.subboard.BLACK_F407ZG.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xG.menu.startadr.default=flash(default)
F407xG.menu.startadr.default.build.extra_flags={build.extra_flags0}

F407xG.menu.startadr.F08020000=flash 1:0x08020000(128k)
F407xG.menu.startadr.F08020000.upload.maximum_size=131072
F407xG.menu.startadr.F08020000.upload.maximum_data_size=131072
F407xG.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F407xG.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
F407xG.menu.startadr.F08020000.upload.uploadadr=0x08020000
F407xG.menu.startadr.F08020000.upload.vect=0x08020000

F407xG.menu.startadr.F08040000=flash 2:0x08040000(128k)
F407xG.menu.startadr.F08040000.upload.maximum_size=131072
F407xG.menu.startadr.F08040000.upload.maximum_data_size=131072
F407xG.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F407xG.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
F407xG.menu.startadr.F08040000.upload.uploadadr=0x08040000
F407xG.menu.startadr.F08040000.upload.vect=0x08040000

F407xG.menu.startadr.F08060000=flash 3:0x08060000(128k)
F407xG.menu.startadr.F08060000.upload.maximum_size=131072
F407xG.menu.startadr.F08060000.upload.maximum_data_size=131072
F407xG.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
F407xG.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
F407xG.menu.startadr.F08060000.upload.uploadadr=0x08060000
F407xG.menu.startadr.F08060000.upload.vect=0x08060000

F407xG.menu.startadr.F08080000=flash 4:0x08080000(128k)
F407xG.menu.startadr.F08080000.upload.maximum_size=131072
F407xG.menu.startadr.F08080000.upload.maximum_data_size=131072
F407xG.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
F407xG.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
F407xG.menu.startadr.F08080000.upload.uploadadr=0x08080000
F407xG.menu.startadr.F08080000.upload.vect=0x08080000

F407xG.menu.startadr.F080A0000=flash 5:0x080A0000(128k)
F407xG.menu.startadr.F080A0000.upload.maximum_size=131072
F407xG.menu.startadr.F080A0000.upload.maximum_data_size=131072
F407xG.menu.startadr.F080A0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xA0000
F407xG.menu.startadr.F080A0000.build.ldscript={build.ldscript_pre}_080A.ld
F407xG.menu.startadr.F080A0000.upload.uploadadr=0x080A0000
F407xG.menu.startadr.F080A0000.upload.vect=0x080A0000

F407xG.menu.startadr.F080C0000=flash 6:0x080C0000(128k)
F407xG.menu.startadr.F080C0000.upload.maximum_size=131072
F407xG.menu.startadr.F080C0000.upload.maximum_data_size=131072
F407xG.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
F407xG.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
F407xG.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
F407xG.menu.startadr.F080C0000.upload.vect=0x080C0000

F407xG.menu.startadr.F080E0000=flash 7:0x080E0000(128k)
F407xG.menu.startadr.F080E0000.upload.maximum_size=131072
F407xG.menu.startadr.F080E0000.upload.maximum_data_size=131072
F407xG.menu.startadr.F080E0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xE0000
F407xG.menu.startadr.F080E0000.build.ldscript={build.ldscript_pre}_080E.ld
F407xG.menu.startadr.F080E0000.upload.uploadadr=0x080E0000
F407xG.menu.startadr.F080E0000.upload.vect=0x080E0000

F407xG.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
F407xG.menu.startadr.F08000000.upload.maximum_size=131072
F407xG.menu.startadr.F08000000.upload.maximum_data_size=32768
F407xG.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F407xG.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
F407xG.menu.startadr.F08000000.upload.uploadadr=0x08000000
F407xG.menu.startadr.F08000000.upload.vect=0x08000000

F407xG.menu.startadr.R20000000=Sram 0:0x20000000(96K+32K BOOT=11 St/Jlink uploader only)
F407xG.menu.startadr.R20000000.upload.maximum_size=98304
F407xG.menu.startadr.R20000000.upload.maximum_data_size=32768
F407xG.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F407xG.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
F407xG.menu.startadr.R20000000.upload.uploadadr=0x20000000
F407xG.menu.startadr.R20000000.upload.vect=0x20000000

F407xG.menu.extern_lib.NONE=NONE
F407xG.menu.extern_lib.STemWin=STemWin
F407xG.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
F407xG.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F407xG.menu.extern_lib.STemWinOS=STemWin_OS
F407xG.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
F407xG.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

