tony-cloud/STM32_duino/STM32/boards.txt
F746S.menu.startadr.R20000000=Sram 0:0x20000000(192K+128K BOOT=11 ST/Jlink uploader only)
F746S.menu.startadr.R20000000.upload.maximum_size=196608
F746S.menu.startadr.R20000000.upload.maximum_data_size=131072
F746S.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F746S.menu.startadr.R20000000.build.ldscript=ld/f746xG_RAM0.ld
F746S.menu.startadr.R20000000.upload.uploadadr=0x20000000
F746S.menu.startadr.R20000000.upload.vect=0x20000000

F746S.menu.usb.Disabled=Disabled USB
F746S.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F746S.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F746S.menu.usb.SerialMSC=Mass storage
F746S.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F746S.menu.usb.Composite=Composite[CDC+MSC]
F746S.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F746S.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/PA10]
F746S.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F746S.menu.serial.SerialUSB=SerialUSB
F746S.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#-------------------------------------- UPLOAD METHODS ----------------------------------------#
F746S.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1]
F746S.menu.upload_method.serialMethod.upload.protocol=maple_serial
F746S.menu.upload_method.serialMethod.upload.tool=serial_upload
F746S.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F746S.menu.upload_method.STLinkMethod=STLink
F746S.menu.upload_method.STLinkMethod.upload.protocol=STLink
F746S.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

F746S.menu.upload_method.jLinkMethod=JLink
F746S.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F746S.menu.upload_method.jLinkMethod.upload.protocol=jlink
F746S.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F746S.menu.log.default=Release
F746S.menu.log.default.build.log_level=-fno-exceptions
F746S.menu.log.fatal=FATAL
F746S.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F746S.menu.log.error=ERROR
F746S.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F746S.menu.log.warning=WARNING
F746S.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F746S.menu.log.info=INFO
F746S.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F746S.menu.log.debug=DEBUG
F746S.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F746S.menu.log.trace=TRACE
F746S.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

###################################### end ##########################################
